XKCANO/ceshi0223/KD001-0111/Library/inc/fm33lf0xx_fl_i2csmb.h
#define    I2CSMB_CR2_RWN_Pos                                     (3U)
#define    I2CSMB_CR2_RWN_Msk                                     (0x1U << I2CSMB_CR2_RWN_Pos)
#define    I2CSMB_CR2_RWN                                         I2CSMB_CR2_RWN_Msk

#define    I2CSMB_CR2_STOP_Pos                                    (2U)
#define    I2CSMB_CR2_STOP_Msk                                    (0x1U << I2CSMB_CR2_STOP_Pos)
#define    I2CSMB_CR2_STOP                                        I2CSMB_CR2_STOP_Msk

#define    I2CSMB_CR2_RESTART_Pos                                 (1U)
#define    I2CSMB_CR2_RESTART_Msk                                 (0x1U << I2CSMB_CR2_RESTART_Pos)
#define    I2CSMB_CR2_RESTART                                     I2CSMB_CR2_RESTART_Msk

#define    I2CSMB_CR2_START_Pos                                   (0U)
#define    I2CSMB_CR2_START_Msk                                   (0x1U << I2CSMB_CR2_START_Pos)
#define    I2CSMB_CR2_START                                       I2CSMB_CR2_START_Msk

#define    I2CSMB_IER_IDLIE_Pos                                   (7U)
#define    I2CSMB_IER_IDLIE_Msk                                   (0x1U << I2CSMB_IER_IDLIE_Pos)
#define    I2CSMB_IER_IDLIE                                       I2CSMB_IER_IDLIE_Msk

#define    I2CSMB_IER_ERRIE_Pos                                   (6U)
#define    I2CSMB_IER_ERRIE_Msk                                   (0x1U << I2CSMB_IER_ERRIE_Pos)
#define    I2CSMB_IER_ERRIE                                       I2CSMB_IER_ERRIE_Msk

#define    I2CSMB_IER_SIE_Pos                                     (5U)
#define    I2CSMB_IER_SIE_Msk                                     (0x1U << I2CSMB_IER_SIE_Pos)
#define    I2CSMB_IER_SIE                                         I2CSMB_IER_SIE_Msk

#define    I2CSMB_IER_PIE_Pos                                     (4U)
#define    I2CSMB_IER_PIE_Msk                                     (0x1U << I2CSMB_IER_PIE_Pos)
#define    I2CSMB_IER_PIE                                         I2CSMB_IER_PIE_Msk

#define    I2CSMB_IER_NACKIE_Pos                                  (3U)
#define    I2CSMB_IER_NACKIE_Msk                                  (0x1U << I2CSMB_IER_NACKIE_Pos)
#define    I2CSMB_IER_NACKIE                                      I2CSMB_IER_NACKIE_Msk

#define    I2CSMB_IER_ADIE_Pos                                    (2U)
#define    I2CSMB_IER_ADIE_Msk                                    (0x1U << I2CSMB_IER_ADIE_Pos)
#define    I2CSMB_IER_ADIE                                        I2CSMB_IER_ADIE_Msk

#define    I2CSMB_IER_TXIE_Pos                                    (1U)
#define    I2CSMB_IER_TXIE_Msk                                    (0x1U << I2CSMB_IER_TXIE_Pos)
#define    I2CSMB_IER_TXIE                                        I2CSMB_IER_TXIE_Msk

#define    I2CSMB_IER_RXIE_Pos                                    (0U)
#define    I2CSMB_IER_RXIE_Msk                                    (0x1U << I2CSMB_IER_RXIE_Pos)
#define    I2CSMB_IER_RXIE                                        I2CSMB_IER_RXIE_Msk

#define    I2CSMB_ISR_SDIR_Pos                                    (16U)
#define    I2CSMB_ISR_SDIR_Msk                                    (0x1U << I2CSMB_ISR_SDIR_Pos)
#define    I2CSMB_ISR_SDIR                                        I2CSMB_ISR_SDIR_Msk

#define    I2CSMB_ISR_ALIF_Pos                                    (13U)
#define    I2CSMB_ISR_ALIF_Msk                                    (0x1U << I2CSMB_ISR_ALIF_Pos)
#define    I2CSMB_ISR_ALIF                                        I2CSMB_ISR_ALIF_Msk

#define    I2CSMB_ISR_TOB_Pos                                     (12U)
#define    I2CSMB_ISR_TOB_Msk                                     (0x1U << I2CSMB_ISR_TOB_Pos)
#define    I2CSMB_ISR_TOB                                         I2CSMB_ISR_TOB_Msk

#define    I2CSMB_ISR_TOA_Pos                                     (11U)
#define    I2CSMB_ISR_TOA_Msk                                     (0x1U << I2CSMB_ISR_TOA_Pos)
#define    I2CSMB_ISR_TOA                                         I2CSMB_ISR_TOA_Msk

#define    I2CSMB_ISR_OVF_Pos                                     (10U)
#define    I2CSMB_ISR_OVF_Msk                                     (0x1U << I2CSMB_ISR_OVF_Pos)
#define    I2CSMB_ISR_OVF                                         I2CSMB_ISR_OVF_Msk

#define    I2CSMB_ISR_BERR_Pos                                    (9U)
#define    I2CSMB_ISR_BERR_Msk                                    (0x1U << I2CSMB_ISR_BERR_Pos)
#define    I2CSMB_ISR_BERR                                        I2CSMB_ISR_BERR_Msk

#define    I2CSMB_ISR_ARLO_Pos                                    (8U)
#define    I2CSMB_ISR_ARLO_Msk                                    (0x1U << I2CSMB_ISR_ARLO_Pos)
#define    I2CSMB_ISR_ARLO                                        I2CSMB_ISR_ARLO_Msk

#define    I2CSMB_ISR_BUSY_Pos                                    (7U)
#define    I2CSMB_ISR_BUSY_Msk                                    (0x1U << I2CSMB_ISR_BUSY_Pos)
#define    I2CSMB_ISR_BUSY                                        I2CSMB_ISR_BUSY_Msk

#define    I2CSMB_ISR_IDLIF_Pos                                   (6U)
#define    I2CSMB_ISR_IDLIF_Msk                                   (0x1U << I2CSMB_ISR_IDLIF_Pos)
#define    I2CSMB_ISR_IDLIF                                       I2CSMB_ISR_IDLIF_Msk

#define    I2CSMB_ISR_SIF_Pos                                     (5U)
#define    I2CSMB_ISR_SIF_Msk                                     (0x1U << I2CSMB_ISR_SIF_Pos)
#define    I2CSMB_ISR_SIF                                         I2CSMB_ISR_SIF_Msk

#define    I2CSMB_ISR_PIF_Pos                                     (4U)
#define    I2CSMB_ISR_PIF_Msk                                     (0x1U << I2CSMB_ISR_PIF_Pos)
#define    I2CSMB_ISR_PIF                                         I2CSMB_ISR_PIF_Msk

#define    I2CSMB_ISR_NACKIF_Pos                                  (3U)
#define    I2CSMB_ISR_NACKIF_Msk                                  (0x1U << I2CSMB_ISR_NACKIF_Pos)
#define    I2CSMB_ISR_NACKIF                                      I2CSMB_ISR_NACKIF_Msk

#define    I2CSMB_ISR_ADIF_Pos                                    (2U)
#define    I2CSMB_ISR_ADIF_Msk                                    (0x1U << I2CSMB_ISR_ADIF_Pos)
#define    I2CSMB_ISR_ADIF                                        I2CSMB_ISR_ADIF_Msk

