XKCANO/ceshi0223/KD001-0111/Library/inc/fm33lf0xx_fl_i2csmb.h
#define    I2CSMB_ISR_TXIF_Pos                                    (1U)
#define    I2CSMB_ISR_TXIF_Msk                                    (0x1U << I2CSMB_ISR_TXIF_Pos)
#define    I2CSMB_ISR_TXIF                                        I2CSMB_ISR_TXIF_Msk

#define    I2CSMB_ISR_RXIF_Pos                                    (0U)
#define    I2CSMB_ISR_RXIF_Msk                                    (0x1U << I2CSMB_ISR_RXIF_Pos)
#define    I2CSMB_ISR_RXIF                                        I2CSMB_ISR_RXIF_Msk

#define    I2CSMB_BGR_BGRH_Pos                                    (16U)
#define    I2CSMB_BGR_BGRH_Msk                                    (0x1ffU << I2CSMB_BGR_BGRH_Pos)
#define    I2CSMB_BGR_BGRH                                        I2CSMB_BGR_BGRH_Msk

#define    I2CSMB_BGR_BGRL_Pos                                    (0U)
#define    I2CSMB_BGR_BGRL_Msk                                    (0x1ffU << I2CSMB_BGR_BGRL_Pos)
#define    I2CSMB_BGR_BGRL                                        I2CSMB_BGR_BGRL_Msk

#define    I2CSMB_TIMINGR_SDAHD_Pos                               (0U)
#define    I2CSMB_TIMINGR_SDAHD_Msk                               (0x1ffU << I2CSMB_TIMINGR_SDAHD_Pos)
#define    I2CSMB_TIMINGR_SDAHD                                   I2CSMB_TIMINGR_SDAHD_Msk

#define    I2CSMB_TOR_TEXTEN_Pos                                  (31U)
#define    I2CSMB_TOR_TEXTEN_Msk                                  (0x1U << I2CSMB_TOR_TEXTEN_Pos)
#define    I2CSMB_TOR_TEXTEN                                      I2CSMB_TOR_TEXTEN_Msk

#define    I2CSMB_TOR_TIMEOUTB_Pos                                (16U)
#define    I2CSMB_TOR_TIMEOUTB_Msk                                (0xfffU << I2CSMB_TOR_TIMEOUTB_Pos)
#define    I2CSMB_TOR_TIMEOUTB                                    I2CSMB_TOR_TIMEOUTB_Msk

#define    I2CSMB_TOR_TOEN_Pos                                    (15U)
#define    I2CSMB_TOR_TOEN_Msk                                    (0x1U << I2CSMB_TOR_TOEN_Pos)
#define    I2CSMB_TOR_TOEN                                        I2CSMB_TOR_TOEN_Msk

#define    I2CSMB_TOR_TIDLE_Pos                                   (12U)
#define    I2CSMB_TOR_TIDLE_Msk                                   (0x1U << I2CSMB_TOR_TIDLE_Pos)
#define    I2CSMB_TOR_TIDLE                                       I2CSMB_TOR_TIDLE_Msk

#define    I2CSMB_TOR_TIMEOUTA_Pos                                (0U)
#define    I2CSMB_TOR_TIMEOUTA_Msk                                (0xfffU << I2CSMB_TOR_TIMEOUTA_Pos)
#define    I2CSMB_TOR_TIMEOUTA                                    I2CSMB_TOR_TIMEOUTA_Msk

#define    I2CSMB_RXDR_RXDATA_Pos                                 (0U)
#define    I2CSMB_RXDR_RXDATA_Msk                                 (0xffU << I2CSMB_RXDR_RXDATA_Pos)
#define    I2CSMB_RXDR_RXDATA                                     I2CSMB_RXDR_RXDATA_Msk

#define    I2CSMB_TXDR_TXDATA_Pos                                 (0U)
#define    I2CSMB_TXDR_TXDATA_Msk                                 (0xffU << I2CSMB_TXDR_TXDATA_Pos)
#define    I2CSMB_TXDR_TXDATA                                     I2CSMB_TXDR_TXDATA_Msk

#define    I2CSMB_SADR_SAEN_Pos                                   (15U)
#define    I2CSMB_SADR_SAEN_Msk                                   (0x1U << I2CSMB_SADR_SAEN_Pos)
#define    I2CSMB_SADR_SAEN                                       I2CSMB_SADR_SAEN_Msk

#define    I2CSMB_SADR_MASK_Pos                                   (12U)
#define    I2CSMB_SADR_MASK_Msk                                   (0xfU << I2CSMB_SADR_MASK_Pos)
#define    I2CSMB_SADR_MASK                                       I2CSMB_SADR_MASK_Msk

#define    I2CSMB_SADR_ADDR_Pos                                   (0U)
#define    I2CSMB_SADR_ADDR_Msk                                   (0x3ffU << I2CSMB_SADR_ADDR_Pos)
#define    I2CSMB_SADR_ADDR                                       I2CSMB_SADR_ADDR_Msk

#define    I2CSMB_CRC_DR_DR_Pos                                   (0U)
#define    I2CSMB_CRC_DR_DR_Msk                                   (0xffU << I2CSMB_CRC_DR_DR_Pos)
#define    I2CSMB_CRC_DR_DR                                       I2CSMB_CRC_DR_DR_Msk

#define    I2CSMB_CRC_LFSR_LFSR_Pos                               (0U)
#define    I2CSMB_CRC_LFSR_LFSR_Msk                               (0xffU << I2CSMB_CRC_LFSR_LFSR_Pos)
#define    I2CSMB_CRC_LFSR_LFSR                                   I2CSMB_CRC_LFSR_LFSR_Msk

#define    I2CSMB_CRC_POLY_POLY_Pos                               (0U)
#define    I2CSMB_CRC_POLY_POLY_Msk                               (0xffU << I2CSMB_CRC_POLY_POLY_Pos)
#define    I2CSMB_CRC_POLY_POLY                                   I2CSMB_CRC_POLY_POLY_Msk






#define    FL_I2CSMB_DIGITAL_FILTER_CLK_DISABLE                   (0x0U << I2CSMB_CR1_DNF_Pos)
#define    FL_I2CSMB_DIGITAL_FILTER_CLK_1                         (0x1U << I2CSMB_CR1_DNF_Pos)
#define    FL_I2CSMB_DIGITAL_FILTER_CLK_2                         (0x2U << I2CSMB_CR1_DNF_Pos)
#define    FL_I2CSMB_DIGITAL_FILTER_CLK_3                         (0x3U << I2CSMB_CR1_DNF_Pos)
#define    FL_I2CSMB_DIGITAL_FILTER_CLK_4                         (0x4U << I2CSMB_CR1_DNF_Pos)
#define    FL_I2CSMB_DIGITAL_FILTER_CLK_5                         (0x5U << I2CSMB_CR1_DNF_Pos)
#define    FL_I2CSMB_DIGITAL_FILTER_CLK_6                         (0x6U << I2CSMB_CR1_DNF_Pos)
#define    FL_I2CSMB_DIGITAL_FILTER_CLK_7                         (0x7U << I2CSMB_CR1_DNF_Pos)
#define    FL_I2CSMB_DIGITAL_FILTER_CLK_8                         (0x8U << I2CSMB_CR1_DNF_Pos)
#define    FL_I2CSMB_DIGITAL_FILTER_CLK_9                         (0x9U << I2CSMB_CR1_DNF_Pos)
#define    FL_I2CSMB_DIGITAL_FILTER_CLK_10                        (0xaU << I2CSMB_CR1_DNF_Pos)
#define    FL_I2CSMB_DIGITAL_FILTER_CLK_11                        (0xbU << I2CSMB_CR1_DNF_Pos)
#define    FL_I2CSMB_DIGITAL_FILTER_CLK_12                        (0xcU << I2CSMB_CR1_DNF_Pos)
#define    FL_I2CSMB_DIGITAL_FILTER_CLK_13                        (0xdU << I2CSMB_CR1_DNF_Pos)
#define    FL_I2CSMB_DIGITAL_FILTER_CLK_14                        (0xeU << I2CSMB_CR1_DNF_Pos)
#define    FL_I2CSMB_DIGITAL_FILTER_CLK_15                        (0xfU << I2CSMB_CR1_DNF_Pos)


#define    FL_I2CSMB_WAKEUP_DISABLE                               (0x0U << I2CSMB_CR1_WKUPEN_Pos)
#define    FL_I2CSMB_WAKEUP_START_ONLY                            (0x1U << I2CSMB_CR1_WKUPEN_Pos)
#define    FL_I2CSMB_WAKEUP_START_BOTH                            (0x2U << I2CSMB_CR1_WKUPEN_Pos)
#define    FL_I2CSMB_WAKEUP_START_ADDRESS                         (0x3U << I2CSMB_CR1_WKUPEN_Pos)


