XKCANO/ceshi0223/KD001-0111/Library/inc/fm33lf0xx_fl_i2csmb.h
/**
  * @brief    Get CRC data
  * @rmtoll   CRC_DR    DR    FL_I2CSMB_ReadCRCData
  * @param    I2CSMBx I2CSMB instance
  * @param    data This parameter can be one of the following values:
  * @retval   
  */
__STATIC_INLINE uint32_t FL_I2CSMB_ReadCRCData(I2CSMB_Type* I2CSMBx, uint32_t data)
{
    return (uint32_t)(READ_BIT(I2CSMBx->CRC_DR, (0xffU << 0U)) >> 0U);
}

/**
  * @brief    Set CRC initial value 
  * @rmtoll   CRC_LFSR    LFSR    FL_I2CSMB_WriteCRCInitialValue
  * @param    I2CSMBx I2CSMB instance
  * @param    data 
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_WriteCRCInitialValue(I2CSMB_Type* I2CSMBx, uint32_t data)
{
    MODIFY_REG(I2CSMBx->CRC_LFSR, (0xffU << 0U), (data << 0U));
}

/**
  * @brief    Get CRC initial value 
  * @rmtoll   CRC_LFSR    LFSR    FL_I2CSMB_ReadCRCInitialValue
  * @param    I2CSMBx I2CSMB instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_I2CSMB_ReadCRCInitialValue(I2CSMB_Type* I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->CRC_LFSR, (0xffU << 0U)) >> 0U);
}

/**
  * @brief    Set CRC Polynominals
  * @rmtoll   CRC_POLY    POLY    FL_I2CSMB_WriteCRCPolynominals
  * @param    I2CSMBx I2CSMB instance
  * @param    data 
  * @retval   None
  */
__STATIC_INLINE void FL_I2CSMB_WriteCRCPolynominals(I2CSMB_Type* I2CSMBx, uint32_t data)
{
    MODIFY_REG(I2CSMBx->CRC_POLY, (0xffU << 0U), (data << 0U));
}

/**
  * @brief    Get CRC Polynominals
  * @rmtoll   CRC_POLY    POLY    FL_I2CSMB_ReadCRCPolynominals
  * @param    I2CSMBx I2CSMB instance
  * @retval   
  */
__STATIC_INLINE uint32_t FL_I2CSMB_ReadCRCPolynominals(I2CSMB_Type* I2CSMBx)
{
    return (uint32_t)(READ_BIT(I2CSMBx->CRC_POLY, (0xffU << 0U)) >> 0U);
}

/**
  * @}
  */

/** @defgroup I2C_SMBUS_FL_EF_Init Initialization and de-initialization functions
  * @{
  */
FL_ErrorStatus FL_I2C_SMBUS_DeInit(I2CSMB_Type *I2CSMBx);
FL_ErrorStatus FL_I2C_SMBUS_MasterMode_Init(I2CSMB_Type *I2CSMBx, FL_I2C_SMBUS_MasterMode_InitTypeDef *I2CSMB_InitStruct);
void FL_I2C_SMBUS_MasterMode_StructInit(FL_I2C_SMBUS_MasterMode_InitTypeDef *I2CSMB_InitStruct);
FL_ErrorStatus FL_I2C_SMBUS_SlaveMode_Init(I2CSMB_Type *I2CSMBx, FL_I2C_SMBUS_SlaveMode_InitTypeDef *I2CSMB_InitStruct);
void FL_I2C_SMBUS_SlaveMode_StructInit(FL_I2C_SMBUS_SlaveMode_InitTypeDef *I2CSMB_InitStruct);

/**
  * @}
  */


/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __FM33FR0XX_FL_I2C_SMBUS_H*/

/*************************Py_Code_Generator Version: 0.1-0.14-0.2 @ 2021-12-07*************************/
/*************************(C) COPYRIGHT Fudan Microelectronics **** END OF FILE*************************/
